import { useState } from "react";
import img1 from "../assets/img/blog/blog-post-1.jpg";
import img2 from "../assets/img/blog/blog-post-2.jpg";
import img3 from "../assets/img/blog/blog-post-3.jpg";
import img4 from "../assets/img/blog/blog-post-4.jpg";
import img5 from "../assets/img/blog/blog-post-5.jpg";
import img6 from "../assets/img/blog/blog-post-6.jpg";

const AllBlogData = () => {
  const blogsData = [
    {
      id: 1,
      img: img1,
      title: "چگونه با ایجاد یک لیست ایمیل صاحب مخاطبان خود شوید",
      commentor: "Rio ",
      date: "21 April 2022",
      tag: `وردپرس، تجارت، اقتصاد، طراحی،`,
      description1:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
      description2:
        "کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
      description3:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
      description4:
        "کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      id: 2,
      img: img2,
      title: "ابزار برتر برای یادگیری عمیق در سال 1400",
      commentor: "Santhan ",
      date: "14 January 2022",
      tag: `وردپرس، تجارت، اقتصاد، طراحی،`,
      description1:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
      description2:
        "اگر منتظر دعوتنامه بودید، این خوشنویسی همان است. به سفارش طراحی دستی نوت بوک برای پوستر. نقل قول نوت بوک بیلدینگ 8 معاون رجینا دوگان است—و من",
      description3:
        "ابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
      description4:
        "ابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      id: 3,
      img: img3,
      title: "هر آنچه که باید در مورد دسترسی به وب بدانید",
      commentor: "steve ",
      date: "9 January 2020",
      tag: `وردپرس، تجارت، اقتصاد، طراحی،`,
      description1:
        "ابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
      description2:
        "اکثر عکاسان دیدن تصاویر جالب در مکان هایی که بیشتر آشنا هستند سخت است. به نظر می رسد یک سفر به جایی جدید همیشه دقیقاً همان چیزی است که عکاسی ما نیاز دارد، زیرا عکاسی دور از خانه به طور مداوم ما را به ارتفاعات هنری جدید الهام می دهد.",
      description3:
        "ابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
      description4:
        "ابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      id: 4,
      img: img4,
      title: "چگونه طنز و کمدی را به برند خود تزریق کنیم",
      commentor: "Beker ",
      date: "15 March 2022",
      tag: `وردپرس، تجارت، اقتصاد، طراحی،`,

      description1:
        "ابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
        
      description2:
        "اکثر عکاسان دیدن تصاویر جالب در مکان هایی که بیشتر آشنا هستند سخت است. به نظر می رسد یک سفر به جایی جدید همیشه دقیقاً همان چیزی است که عکاسی ما نیاز دارد، زیرا عکاسی دور از خانه به طور مداوم ما را به ارتفاعات هنری جدید الهام می دهد. ",
      description3:
        "ابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
      description4:
        "ابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
         
    },
    {
      id: 5,
      img: img5,
      title: "زنان در طراحی وب سایت: چگونه به موفقیت برسیم",
      commentor: "Janntul ",
      date: "9 January 2021",
      tag: `وردپرس، تجارت، اقتصاد، طراحی،`,
      description1:
        "اکثر عکاسان دیدن تصاویر جالب در مکان هایی که بیشتر آشنا هستند سخت است. به نظر می رسد یک سفر به جایی جدید همیشه دقیقاً همان چیزی است که عکاسی ما نیاز دارد، زیرا عکاسی دور از خانه به طور مداوم ما را به ارتفاعات هنری جدید الهام می دهد. ",

      description2:
        "اکثر عکاسان دیدن تصاویر جالب در مکان هایی که بیشتر آشنا هستند سخت است. به نظر می رسد یک سفر به جایی جدید همیشه دقیقاً همان چیزی است که عکاسی ما نیاز دارد، زیرا عکاسی دور از خانه به طور مداوم ما را به ارتفاعات هنری جدید الهام می دهد. ",
      description3:
        "اکثر عکاسان دیدن تصاویر جالب در مکان هایی که بیشتر آشنا هستند سخت است. به نظر می رسد یک سفر به جایی جدید همیشه دقیقاً همان چیزی است که عکاسی ما نیاز دارد، زیرا عکاسی دور از خانه به طور مداوم ما را به ارتفاعات هنری جدید الهام می دهد. ",
        
      description4:
        "اکثر عکاسان دیدن تصاویر جالب در مکان هایی که بیشتر آشنا هستند سخت است. به نظر می رسد یک سفر به جایی جدید همیشه دقیقاً همان چیزی است که عکاسی ما نیاز دارد، زیرا عکاسی دور از خانه به طور مداوم ما را به ارتفاعات هنری جدید الهام می دهد. ",
        
    },
    {
      id: 6,
      img: img6,
      title: "همیشه سبز در مقابل محتوای موضوعی: یک مرور کلی",
      commentor: "Hasan ",
      date: "9 January 2022",
      tag: `وردپرس، تجارت، اقتصاد، طراحی،`,
      description1:
        "اکثر عکاسان دیدن تصاویر جالب در مکان هایی که بیشتر آشنا هستند سخت است. به نظر می رسد یک سفر به جایی جدید همیشه دقیقاً همان چیزی است که عکاسی ما نیاز دارد، زیرا عکاسی دور از خانه به طور مداوم ما را به ارتفاعات هنری جدید الهام می دهد. ",
        
      description2:
        "اکثر عکاسان دیدن تصاویر جالب در مکان هایی که بیشتر آشنا هستند سخت است. به نظر می رسد یک سفر به جایی جدید همیشه دقیقاً همان چیزی است که عکاسی ما نیاز دارد، زیرا عکاسی دور از خانه به طور مداوم ما را به ارتفاعات هنری جدید الهام می دهد. ",
      description3:
        "اکثر عکاسان دیدن تصاویر جالب در مکان هایی که بیشتر آشنا هستند سخت است. به نظر می رسد یک سفر به جایی جدید همیشه دقیقاً همان چیزی است که عکاسی ما نیاز دارد، زیرا عکاسی دور از خانه به طور مداوم ما را به ارتفاعات هنری جدید الهام می دهد. ",
        
      description4:
        "اکثر عکاسان دیدن تصاویر جالب در مکان هایی که بیشتر آشنا هستند سخت است. به نظر می رسد یک سفر به جایی جدید همیشه دقیقاً همان چیزی است که عکاسی ما نیاز دارد، زیرا عکاسی دور از خانه به طور مداوم ما را به ارتفاعات هنری جدید الهام می دهد. ",
      
    },
  ];

  const [singleData, setSingleData] = useState({});
  const [isOpen, setIsOpen] = useState(false);

  const handleBlogsData = (id) => {
    const find = blogsData.find((item) => item?.id === id);
    setSingleData(find);
    setIsOpen(true);
  };

  return {
    singleData,
    isOpen,
    setIsOpen,
    blogsData,
    handleBlogsData,
  };
};

export default AllBlogData;
